{
  "kind": "build_request",
  "title": "Add dance style dropdown on main screen",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add a dropdown input on the app’s main screen that lets the user select a dance style from: \"Bollywood\", \"Classical\", \"Semi-classical\", and \"Indo Fusion\". Display a clear label above the dropdown in English (e.g., \"Dance style\") and show the currently selected value on the screen (e.g., as helper text below the dropdown).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Enter dance stykes such as bollywood,classical,semi classical,indo fusion",
          "A drop down input",
          "Main screen"
        ]
      },
      "acceptanceCriteria": [
        "The main screen renders a labeled dropdown control.",
        "The dropdown contains exactly these options: Bollywood, Classical, Semi-classical, Indo Fusion.",
        "Selecting an option updates the UI to reflect the current selection.",
        "All user-facing text for this feature is in English."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Apply a coherent, creative visual theme for the main screen (colors, typography, spacing, and component styling) and use it consistently for the dropdown section without introducing new product features.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Main screen"
        ]
      },
      "acceptanceCriteria": [
        "The main screen has a consistent visual style (background, typography, spacing).",
        "The dropdown section looks intentionally designed and consistent with the theme.",
        "No new functionality beyond styling/layout is introduced by this requirement."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/components/ui (Shadcn UI sources must be composed, not edited).",
    "Do not modify any files listed as immutable in SYSTEM_CONTEXT."
  ],
  "nonGoals": [
    "Adding additional dance styles beyond: Bollywood, Classical, Semi-classical, Indo Fusion.",
    "Persisting the selected dance style to the backend or across reloads.",
    "Adding authentication changes (sign-in is out of scope for this request)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}