{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Dance style dropdown on main screen with cohesive theme",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add a labeled dance style dropdown on the main screen with the exact four options and show the current selection in the UI.",
      "acceptanceCriteria": [
        "The main screen renders a labeled dropdown control.",
        "The dropdown contains exactly these options: Bollywood, Classical, Semi-classical, Indo Fusion.",
        "Selecting an option updates the UI to reflect the current selection.",
        "All user-facing text for this feature is in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "create",
          "description": "Implement the main screen UI and state for the dance style selection using a native HTML select with exactly the four allowed options, an English label (e.g., \"Dance style\"), and helper text below showing the currently selected value. Ensure selection is in-memory only (no persistence across reloads)."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Apply a consistent creative visual theme to the main screen and style the dropdown section without adding any new functionality.",
      "acceptanceCriteria": [
        "The main screen has a consistent visual style (background, typography, spacing).",
        "The dropdown section looks intentionally designed and consistent with the theme.",
        "No new functionality beyond styling/layout is introduced by this requirement."
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "create",
          "description": "Add the app’s global styling entry point referenced by main.tsx, including Tailwind directives and a cohesive theme foundation (e.g., background, typography defaults, spacing rhythm) that the main screen can rely on."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Refine the main screen layout and component styling to match the theme (consistent spacing, typography, background treatment, and dropdown section styling) without introducing any behavior beyond visual/layout changes."
        }
      ]
    }
  ]
}